[NoCoverage] BlockStatement
src/services/accounts.service.js:3:62
 const { validateAmount, canWithdraw } = require("./money");
 
-async function createAccount(pool, { owner, currency } = {}) {
-  if (!owner || typeof owner !== "string" || !owner.trim()) {
-    const err = new Error("El titular es obligatorio");
-    err.status = 400;
-    throw err;
-  }
-  const { rows } = await pool.query(
-    "INSERT INTO accounts (owner, currency) VALUES ($1, $2) " +
-      "RETURNING id, owner, balance, currency, status, created_at",
-    [owner.trim(), currency || "PEN"]
-  );
-  return rows[0];
-}
+async function createAccount(pool, { owner, currency } = {}) {}
 
 async function getAccount(pool, id) {

[NoCoverage] BooleanLiteral
src/services/accounts.service.js:4:46
 const { validateAmount, canWithdraw } = require("./money");
 
 async function createAccount(pool, { owner, currency } = {}) {
-  if (!owner || typeof owner !== "string" || !owner.trim()) {
+  if (!owner || typeof owner !== "string" || owner.trim()) {
     const err = new Error("El titular es obligatorio");
     err.status = 400;

[NoCoverage] BooleanLiteral
src/services/accounts.service.js:4:7
 const { validateAmount, canWithdraw } = require("./money");
 
 async function createAccount(pool, { owner, currency } = {}) {
-  if (!owner || typeof owner !== "string" || !owner.trim()) {
+  if (owner || typeof owner !== "string" || !owner.trim()) {
     const err = new Error("El titular es obligatorio");
     err.status = 400;

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:12:20
   const { rows } = await pool.query(
     "INSERT INTO accounts (owner, currency) VALUES ($1, $2) " +
       "RETURNING id, owner, balance, currency, status, created_at",
-    [owner.trim(), currency || "PEN"]
+    [owner.trim(), false]
   );
   return rows[0];

[NoCoverage] MethodExpression
src/services/accounts.service.js:12:6
   const { rows } = await pool.query(
     "INSERT INTO accounts (owner, currency) VALUES ($1, $2) " +
       "RETURNING id, owner, balance, currency, status, created_at",
-    [owner.trim(), currency || "PEN"]
+    [owner, currency || "PEN"]
   );
   return rows[0];

[NoCoverage] BlockStatement
src/services/accounts.service.js:17:37
   return rows[0];
 }
 
-async function getAccount(pool, id) {
-  const { rows } = await pool.query(
-    "SELECT id, owner, balance, currency, status, created_at " +
-      "FROM accounts WHERE id = $1",
-    [id]
-  );
-  return rows[0] || null;
-}
+async function getAccount(pool, id) {}
 
 async function listAccounts(pool) {

[NoCoverage] ArrayDeclaration
src/services/accounts.service.js:21:5
   const { rows } = await pool.query(
     "SELECT id, owner, balance, currency, status, created_at " +
       "FROM accounts WHERE id = $1",
-    [id]
+    []
   );
   return rows[0] || null;

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:23:10
       "FROM accounts WHERE id = $1",
     [id]
   );
-  return rows[0] || null;
+  return false;
 }
 

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:23:10
       "FROM accounts WHERE id = $1",
     [id]
   );
-  return rows[0] || null;
+  return true;
 }
 

[NoCoverage] BlockStatement
src/services/accounts.service.js:26:35
   return rows[0] || null;
 }
 
-async function listAccounts(pool) {
-  const { rows } = await pool.query(
-    "SELECT id, owner, balance, currency, status, created_at " +
-      "FROM accounts ORDER BY id DESC"
-  );
-  return rows;
-}
+async function listAccounts(pool) {}
 
 async function deposit(pool, id, amountCents) {

[NoCoverage] StringLiteral
src/services/accounts.service.js:28:5
 
 async function listAccounts(pool) {
   const { rows } = await pool.query(
-    "SELECT id, owner, balance, currency, status, created_at " +
+    "" +
       "FROM accounts ORDER BY id DESC"
   );

[NoCoverage] BlockStatement
src/services/accounts.service.js:34:47
   return rows;
 }
 
-async function deposit(pool, id, amountCents) {
-  validateAmount(amountCents);
-  const { rows } = await pool.query(
-    "UPDATE accounts SET balance = balance + $1 WHERE id = $2 " +
-      "RETURNING id, owner, balance, currency, status",
-    [amountCents, id]
-  );
-  if (rows.length === 0) {
-    const err = new Error("Cuenta no encontrada");
-    err.status = 404;
-    throw err;
-  }
-  return rows[0];
-}
+async function deposit(pool, id, amountCents) {}
 
 async function withdraw(pool, id, amountCents) {

[NoCoverage] StringLiteral
src/services/accounts.service.js:37:5
 async function deposit(pool, id, amountCents) {
   validateAmount(amountCents);
   const { rows } = await pool.query(
-    "UPDATE accounts SET balance = balance + $1 WHERE id = $2 " +
+    "" +
       "RETURNING id, owner, balance, currency, status",
     [amountCents, id]

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:41:7
       "RETURNING id, owner, balance, currency, status",
     [amountCents, id]
   );
-  if (rows.length === 0) {
+  if (false) {
     const err = new Error("Cuenta no encontrada");
     err.status = 404;

[NoCoverage] EqualityOperator
src/services/accounts.service.js:41:7
       "RETURNING id, owner, balance, currency, status",
     [amountCents, id]
   );
-  if (rows.length === 0) {
+  if (rows.length !== 0) {
     const err = new Error("Cuenta no encontrada");
     err.status = 404;

[NoCoverage] BlockStatement
src/services/accounts.service.js:49:48
   return rows[0];
 }
 
-async function withdraw(pool, id, amountCents) {
-  validateAmount(amountCents);
-  const account = await getAccount(pool, id);
-  if (!account) {
-    const err = new Error("Cuenta no encontrada");
-    err.status = 404;
-    throw err;
-  }
-  if (!canWithdraw(Number(account.balance), amountCents)) {
-    const err = new Error("Fondos insuficientes");
-    err.status = 422;
-    throw err;
-  }
-  const nuevoSaldo = Number(account.balance) - amountCents;
-  await pool.query("UPDATE accounts SET balance = $1 WHERE id = $2", [
-    nuevoSaldo,
-    id,
-  ]);
-  return { ...account, balance: nuevoSaldo };
-}
+async function withdraw(pool, id, amountCents) {}
 
 async function transfer(pool, { fromId, toId, amountCents, reference } = {}) {

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:52:7
 async function withdraw(pool, id, amountCents) {
   validateAmount(amountCents);
   const account = await getAccount(pool, id);
-  if (!account) {
+  if (false) {
     const err = new Error("Cuenta no encontrada");
     err.status = 404;

[NoCoverage] BlockStatement
src/services/accounts.service.js:52:17
 async function withdraw(pool, id, amountCents) {
   validateAmount(amountCents);
   const account = await getAccount(pool, id);
-  if (!account) {
-    const err = new Error("Cuenta no encontrada");
-    err.status = 404;
-    throw err;
-  }
+  if (!account) {}
   if (!canWithdraw(Number(account.balance), amountCents)) {
     const err = new Error("Fondos insuficientes");

[NoCoverage] BooleanLiteral
src/services/accounts.service.js:57:7
     err.status = 404;
     throw err;
   }
-  if (!canWithdraw(Number(account.balance), amountCents)) {
+  if (canWithdraw(Number(account.balance), amountCents)) {
     const err = new Error("Fondos insuficientes");
     err.status = 422;

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:57:7
     err.status = 404;
     throw err;
   }
-  if (!canWithdraw(Number(account.balance), amountCents)) {
+  if (true) {
     const err = new Error("Fondos insuficientes");
     err.status = 422;

[NoCoverage] ArithmeticOperator
src/services/accounts.service.js:62:22
     err.status = 422;
     throw err;
   }
-  const nuevoSaldo = Number(account.balance) - amountCents;
+  const nuevoSaldo = Number(account.balance) + amountCents;
   await pool.query("UPDATE accounts SET balance = $1 WHERE id = $2", [
     nuevoSaldo,

[NoCoverage] ObjectLiteral
src/services/accounts.service.js:67:10
     nuevoSaldo,
     id,
   ]);
-  return { ...account, balance: nuevoSaldo };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/services/accounts.service.js:76:21
   const from = await getAccount(pool, fromId);
   const to = await getAccount(pool, toId);
 
-  if (!from || !to) {
-    const err = new Error("Cuenta de origen o destino no encontrada");
-    err.status = 404;
-    throw err;
-  }
+  if (!from || !to) {}
 
   if (!canWithdraw(Number(from.balance), amountCents)) {

[NoCoverage] BooleanLiteral
src/services/accounts.service.js:76:7
   const from = await getAccount(pool, fromId);
   const to = await getAccount(pool, toId);
 
-  if (!from || !to) {
+  if (from || !to) {
     const err = new Error("Cuenta de origen o destino no encontrada");
     err.status = 404;

[NoCoverage] StringLiteral
src/services/accounts.service.js:77:27
   const to = await getAccount(pool, toId);
 
   if (!from || !to) {
-    const err = new Error("Cuenta de origen o destino no encontrada");
+    const err = new Error("");
     err.status = 404;
     throw err;

[NoCoverage] BlockStatement
src/services/accounts.service.js:82:56
     throw err;
   }
 
-  if (!canWithdraw(Number(from.balance), amountCents)) {
-    const err = new Error("Fondos insuficientes");
-    err.status = 422;
-    throw err;
-  }
+  if (!canWithdraw(Number(from.balance), amountCents)) {}
 
   await pool.query(

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:82:7
     throw err;
   }
 
-  if (!canWithdraw(Number(from.balance), amountCents)) {
+  if (false) {
     const err = new Error("Fondos insuficientes");
     err.status = 422;

[NoCoverage] StringLiteral
src/services/accounts.service.js:93:5
     [amountCents, fromId]
   );
   await pool.query(
-    "UPDATE accounts SET balance = balance + $1 WHERE id = $2",
+    "",
     [amountCents, toId]
   );

[NoCoverage] ArrayDeclaration
src/services/accounts.service.js:94:5
   );
   await pool.query(
     "UPDATE accounts SET balance = balance + $1 WHERE id = $2",
-    [amountCents, toId]
+    []
   );
 

[NoCoverage] StringLiteral
src/services/accounts.service.js:99:7
 
   const { rows } = await pool.query(
     "INSERT INTO transfers (from_account, to_account, amount, reference) " +
-      "VALUES ($1, $2, $3, $4) RETURNING id, from_account, to_account, amount, reference, created_at",
+      "",
     [fromId, toId, amountCents, reference || null]
   );

[NoCoverage] LogicalOperator
src/services/accounts.service.js:100:33
   const { rows } = await pool.query(
     "INSERT INTO transfers (from_account, to_account, amount, reference) " +
       "VALUES ($1, $2, $3, $4) RETURNING id, from_account, to_account, amount, reference, created_at",
-    [fromId, toId, amountCents, reference || null]
+    [fromId, toId, amountCents, reference && null]
   );
   return rows[0];

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:100:33
   const { rows } = await pool.query(
     "INSERT INTO transfers (from_account, to_account, amount, reference) " +
       "VALUES ($1, $2, $3, $4) RETURNING id, from_account, to_account, amount, reference, created_at",
-    [fromId, toId, amountCents, reference || null]
+    [fromId, toId, amountCents, false]
   );
   return rows[0];
