[Killed] BlockStatement
src/services/money.js:1:26
-function toCents(amount) {
-  if (typeof amount !== "number" || Number.isNaN(amount)) {
-    const err = new Error("El monto debe ser un numero");
-    err.status = 400;
-    throw err;
-  }
-  return Math.round(amount * 100);
-}
+function toCents(amount) {}
 
 function toUnits(cents) {
killedBy: money (pruebas unitarias) toCents convierte unidades a centimos enteros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1050
Received: undefined

[Killed] ConditionalExpression
src/services/money.js:2:7
 function toCents(amount) {
-  if (typeof amount !== "number" || Number.isNaN(amount)) {
+  if (true) {
     const err = new Error("El monto debe ser un numero");
     err.status = 400;
killedBy: money (pruebas unitarias) toCents convierte unidades a centimos enteros
statusReason: Error: El monto debe ser un numero

[Killed] ConditionalExpression
src/services/money.js:2:7
 function toCents(amount) {
-  if (typeof amount !== "number" || Number.isNaN(amount)) {
+  if (false || Number.isNaN(amount)) {
     const err = new Error("El monto debe ser un numero");
     err.status = 400;
killedBy: money (pruebas unitarias) toCents rechaza valores no numericos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El monto debe ser un numero"

Received function did not throw

[Killed] ArithmeticOperator
src/services/money.js:7:21
     err.status = 400;
     throw err;
   }
-  return Math.round(amount * 100);
+  return Math.round(amount / 100);
 }
 
killedBy: money (pruebas unitarias) toCents convierte unidades a centimos enteros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1050
Received: 0

[NoCoverage] BlockStatement
src/services/money.js:10:25
   return Math.round(amount * 100);
 }
 
-function toUnits(cents) {
-  return cents / 100;
-}
+function toUnits(cents) {}
 
 function formatMoney(cents, currency = "PEN") {

[NoCoverage] ArithmeticOperator
src/services/money.js:11:10
 }
 
 function toUnits(cents) {
-  return cents / 100;
+  return cents * 100;
 }
 

[Killed] BlockStatement
src/services/money.js:14:47
   return cents / 100;
 }
 
-function formatMoney(cents, currency = "PEN") {
-//  const units = (cents / 100).toString();
-  const units = (cents / 100).toFixed(2);
-  return `${currency} ${units}`;
-}
+function formatMoney(cents, currency = "PEN") {}
 
 function validateAmount(cents) {
killedBy: money (pruebas unitarias) formatMoney presenta el importe con dos decimales y moneda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PEN 10.50"
Received: undefined

[Killed] ArithmeticOperator
src/services/money.js:16:18
 
 function formatMoney(cents, currency = "PEN") {
 //  const units = (cents / 100).toString();
-  const units = (cents / 100).toFixed(2);
+  const units = (cents * 100).toFixed(2);
   return `${currency} ${units}`;
 }
killedBy: money (pruebas unitarias) formatMoney presenta el importe con dos decimales y moneda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PEN 10.50"
Received: "PEN 105000.00"

[Killed] StringLiteral
src/services/money.js:17:10
 function formatMoney(cents, currency = "PEN") {
 //  const units = (cents / 100).toString();
   const units = (cents / 100).toFixed(2);
-  return `${currency} ${units}`;
+  return ``;
 }
 
killedBy: money (pruebas unitarias) formatMoney presenta el importe con dos decimales y moneda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PEN 10.50"
Received: ""

[Killed] BlockStatement
src/services/money.js:20:32
   return `${currency} ${units}`;
 }
 
-function validateAmount(cents) {
-  if (!Number.isInteger(cents)) {
-    const err = new Error("El monto debe expresarse en centimos enteros");
-    err.status = 400;
-    throw err;
-  }
-  if (cents <= 0) {
-    const err = new Error("El monto debe ser mayor que cero");
-    err.status = 400;
-    throw err;
-  }
-  return true;
-}
+function validateAmount(cents) {}
 
 function canWithdraw(balanceCents, amountCents) {
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/services/money.js:21:7
 }
 
 function validateAmount(cents) {
-  if (!Number.isInteger(cents)) {
+  if (false) {
     const err = new Error("El monto debe expresarse en centimos enteros");
     err.status = 400;
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "centimos enteros"

Received function did not throw

[Killed] BlockStatement
src/services/money.js:21:33
 }
 
 function validateAmount(cents) {
-  if (!Number.isInteger(cents)) {
-    const err = new Error("El monto debe expresarse en centimos enteros");
-    err.status = 400;
-    throw err;
-  }
+  if (!Number.isInteger(cents)) {}
   if (cents <= 0) {
     const err = new Error("El monto debe ser mayor que cero");
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "centimos enteros"

Received function did not throw

[Killed] EqualityOperator
src/services/money.js:26:7
     err.status = 400;
     throw err;
   }
-  if (cents <= 0) {
+  if (cents < 0) {
     const err = new Error("El monto debe ser mayor que cero");
     err.status = 400;
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "mayor que cero"

Received function did not throw

[Killed] ConditionalExpression
src/services/money.js:26:7
     err.status = 400;
     throw err;
   }
-  if (cents <= 0) {
+  if (true) {
     const err = new Error("El monto debe ser mayor que cero");
     err.status = 400;
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: El monto debe ser mayor que cero

[Killed] BlockStatement
src/services/money.js:34:49
   return true;
 }
 
-function canWithdraw(balanceCents, amountCents) {
-return balanceCents >= amountCents;
-//  return balanceCents < amountCents;
-}
+function canWithdraw(balanceCents, amountCents) {}
 
 
killedBy: money (pruebas unitarias) canWithdraw permite retirar exactamente el saldo disponible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/services/money.js:35:8
 }
 
 function canWithdraw(balanceCents, amountCents) {
-return balanceCents >= amountCents;
+return false;
 //  return balanceCents < amountCents;
 }
killedBy: money (pruebas unitarias) canWithdraw permite retirar exactamente el saldo disponible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/money.js:35:8
 }
 
 function canWithdraw(balanceCents, amountCents) {
-return balanceCents >= amountCents;
+return true;
 //  return balanceCents < amountCents;
 }
killedBy: money (pruebas unitarias) canWithdraw permite retirar exactamente el saldo disponible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/money.js:40:40
 }
 
 
-function applyFee(amountCents, feeBps) {
-  const fee = Math.round((amountCents * feeBps) / 10000);
-  return amountCents + fee;
-}
+function applyFee(amountCents, feeBps) {}
 
 function computeInterest(principal, rate, days) {
killedBy: money (pruebas unitarias) applyFee suma la comision en puntos basicos al monto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10050
Received: undefined

[Killed] ArithmeticOperator
src/services/money.js:41:26
 
 
 function applyFee(amountCents, feeBps) {
-  const fee = Math.round((amountCents * feeBps) / 10000);
+  const fee = Math.round(amountCents * feeBps * 10000);
   return amountCents + fee;
 }
killedBy: money (pruebas unitarias) applyFee suma la comision en puntos basicos al monto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10050
Received: 5000010000

[Killed] ArithmeticOperator
src/services/money.js:41:27
 
 
 function applyFee(amountCents, feeBps) {
-  const fee = Math.round((amountCents * feeBps) / 10000);
+  const fee = Math.round((amountCents / feeBps) / 10000);
   return amountCents + fee;
 }
killedBy: money (pruebas unitarias) applyFee suma la comision en puntos basicos al monto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10050
Received: 10000

[Killed] ArithmeticOperator
src/services/money.js:42:10
 
 function applyFee(amountCents, feeBps) {
   const fee = Math.round((amountCents * feeBps) / 10000);
-  return amountCents + fee;
+  return amountCents - fee;
 }
 
killedBy: money (pruebas unitarias) applyFee suma la comision en puntos basicos al monto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10050
Received: 9950

[Killed] BlockStatement
src/services/money.js:45:49
   return amountCents + fee;
 }
 
-function computeInterest(principal, rate, days) {
-  // Fórmula: (Principal * Tasa * Días) / (365 * 100)
-  return Math.round((principal * rate * days) / (365 * 100));
-}
+function computeInterest(principal, rate, days) {}
 
 function buildTransferReceipt({ id, fromOwner, toOwner, amountCents, currency, reference }) {
killedBy: money (pruebas unitarias) M4-KILLER: computeInterest aplica correctamente la tasa porcentual dividiendo por 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9863
Received: undefined

[Killed] ArithmeticOperator
src/services/money.js:47:50
 
 function computeInterest(principal, rate, days) {
   // Fórmula: (Principal * Tasa * Días) / (365 * 100)
-  return Math.round((principal * rate * days) / (365 * 100));
+  return Math.round((principal * rate * days) / (365 / 100));
 }
 
killedBy: money (pruebas unitarias) M4-KILLER: computeInterest aplica correctamente la tasa porcentual dividiendo por 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9863
Received: 98630137

[Killed] ArithmeticOperator
src/services/money.js:47:22
 
 function computeInterest(principal, rate, days) {
   // Fórmula: (Principal * Tasa * Días) / (365 * 100)
-  return Math.round((principal * rate * days) / (365 * 100));
+  return Math.round((principal / rate * days) / (365 * 100));
 }
 
killedBy: money (pruebas unitarias) M4-KILLER: computeInterest aplica correctamente la tasa porcentual dividiendo por 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9863
Received: 99

[NoCoverage] BlockStatement
src/services/money.js:50:93
   return Math.round((principal * rate * days) / (365 * 100));
 }
 
-function buildTransferReceipt({ id, fromOwner, toOwner, amountCents, currency, reference }) {
-  return {
-    receiptId: id,
-    summary: `${fromOwner} -> ${toOwner}`,
-    amount: formatMoney(amountCents, currency),
-    reference: reference || "SIN-REFERENCIA",
-  };
-}
+function buildTransferReceipt({ id, fromOwner, toOwner, amountCents, currency, reference }) {}
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/services/money.js:55:16
     receiptId: id,
     summary: `${fromOwner} -> ${toOwner}`,
     amount: formatMoney(amountCents, currency),
-    reference: reference || "SIN-REFERENCIA",
+    reference: false,
   };
 }

[NoCoverage] ConditionalExpression
src/services/money.js:55:16
     receiptId: id,
     summary: `${fromOwner} -> ${toOwner}`,
     amount: formatMoney(amountCents, currency),
-    reference: reference || "SIN-REFERENCIA",
+    reference: true,
   };
 }
